
## Plan Result (terraform/aws/external-secrets-operator)

[CI link](https://github.com/boxp/arch/actions/runs/8266922233)


<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_iam_policy.external_secret_policy
  * aws_iam_role.external_secrets_role
  * aws_iam_role_policy_attachment.external_secrets_policy_attachment
  * aws_iam_user.external_secrets_user


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_policy.external_secret_policy will be created
  + resource "aws_iam_policy" "external_secret_policy" {
      + arn         = (known after apply)
      + description = "Policy for accessing SSM parameters"
      + id          = (known after apply)
      + name        = "external_secret_policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                          + "ssm:GetParameters",
                          + "ssm:GetParametersByPath",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.external_secrets_role will be created
  + resource "aws_iam_role" "external_secrets_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "external_secrets_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.external_secrets_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "external_secrets_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "external_secrets_role"
    }

  # aws_iam_user.external_secrets_user will be created
  + resource "aws_iam_user" "external_secrets_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "external_secrets_user"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label terraform/aws/external-secrets-operator/add-or-update: POST https://api.github.com/repos/boxp/arch/issues/53/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":53,"Program":"tfcmt","SHA1":"e2c1709f050d204d960ebf29b5cecf2b043b0bcc","Target":"terraform/aws/external-secrets-operator","Vars":{},"WorkflowName":"pull_request_target"} -->